#include"Crab.h"
#include "cocos2d.h"

USING_NS_CC;

/*****************************************************************
*　概要　　　コンストラクタ
*　引き数　　無し
******************************************************************/
Crab::Crab()
{
	
}

/*****************************************************************
*　概要　　　デストラクタ
*　引き数　　無し
******************************************************************/
Crab::~Crab()
{

}

/*****************************************************************
*　概要　　　初期化
*　引き数　　無し
******************************************************************/
bool Crab::init()
{

	if (!Node::init())
	{

		return false;
	}

	//カニのスプライトの作成
	Sprite *Crab = Sprite::create("kani.png");
	this->addChild(Crab);

	m_haveChara = nullptr;

	return true;

}

void Crab::update()
{
	if (m_haveChara != nullptr)
	{
		m_haveChara->setPosition(this->_position + Vec2(-32.0f, 32.0f));
	}
}

Chara * Crab::getHaveChara()
{
	return m_haveChara;
}


auto listener = EventListenerTouchOneByOne::create();




/*****************************************************************
*　概要　　　動き
*　引き数　　タッチ座標
******************************************************************/
void Crab::Move(Vec2 pos)
{
	MoveTo* Move = MoveTo::create(1.0f, Vec2(pos.x, pos.y));
	Move->setTag(0);

	// 既にムーブアクションを起こしているなら
	if (this->getActionByTag(0))
	{
		//this->stopAllActions();
	}
	else
	{
		this->runAction(Move);
	}
}

/*****************************************************************
*　概要　　　文字をはさむ
*　引き数　　無し
******************************************************************/
void Crab::HavingCharacter(Chara* chara)
{
	if (m_haveChara == nullptr)
	{
		m_haveChara = chara;
	}
}

/*****************************************************************
*　概要　　　文字を離す
*　引き数　　無し
******************************************************************/
void Crab::ReleaseCharacter()
{
	m_haveChara = nullptr;
}

/*****************************************************************
*　概要　　　文字を切る
*　引き数　　無し
******************************************************************/
void Crab::CuttingCharacter()
{

}

/*****************************************************************
*　概要　　　看板にはめる
*　引き数　　無し
******************************************************************/
void Crab::PutOn()
{

}

/*****************************************************************
*　概要　　　アニメーション
*　引き数　　無し
******************************************************************/
void Crab::Animation()
{

}